---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AllowAutoEmbed
source: html/8c55d24e-f7ee-ad32-1c46-6acf7eb732ab.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AllowAutoEmbed Property

"Automatically Embed"

## Syntax (C#)
```csharp
public static ForgeTypeId AllowAutoEmbed { get; }
```